Type=Activity
Version=3.5
@EndOfDesignText@
#Region  Activity Attributes 
	#FullScreen: true
	#IncludeTitle: false
#End Region

Sub Process_Globals
	'These global variables will be declared once when the application starts.
	'These variables can be accessed from all modules.

End Sub

Sub Globals
	Dim pin1 As ImageView
	




	Dim Panel As Panel
	
	Dim clv2 As CustomListView
	
	Dim Panel2 As Panel
End Sub

Sub Activity_Create(FirstTime As Boolean)
	Activity.LoadLayout("thraki.bal")
    
  pin1.Top = 0%y
	pin1.Left =33.3%x
	pin1.Width = 25%x
	pin1.Height = 20%y
	
	
	
	

	
	
	
	
  
  
clv2.Initialize(Me, "clv2")
		Panel2.AddView(clv2.AsView, 0, 0,100%x ,80%y )
	 Panel2.Top = 20%y
  Panel2.Left = 0%x
  Panel2.Width = 100%x
  Panel2.Height = 80%y
	clv2.DefaultTextBackgroundColor = Colors.DarkGray
	clv2.AddTextItem("ΚΙΝΔΥΝΟΙ", "")
	clv2.AddTextItem("Ανάφλεξη (από σπινθήρα, τσιγάρο κλπ.), έκρηξη, παραγωγή εύφλεκτων ατμών, ασφυξία σε κλειστούς χώρους, διάβρωση, τοξικότητα (πρόκληση δηλητηρίασης και μόλυνσης υδάτων). Τα κενά δοχεία που δεν έχουν καθαριστεί πρέπει να αντιμετωπίζονται σαν να ήταν πλήρη. Ορισμένα υγρά μεταφέρονται σε θερμή κατάσταση. Η επαφή τους με μέταλλα είναι ικανή να δημιουργήσει εύφλεκτο αέριο υδρογόνο. Η αντίδραση τους με το νερό ή με υγρό αέρα απελευθερώνει τοξικά, διαβρωτικά ή εύφλεκτα αέρια. Οι περισσότεροι ατμοί είναι βαρύτεροι του αέρα,εξαπλώνονται σε όλη την έκταση του εδάφους και συγκεντρώνονται σε κλειστούς χώρους ή χώρους που βρίσκονται χαμηλά. Ορισμένες ουσίες μπορεί να πολυμερισθούν με εκρηκτικό τρόπο όταν θερμανθούν ή εμπλακούν σε φωτιά. Πολλά υγρά είναι μη αναμίξιμα και ελαφρύτερα του νερού με αποτέλεσμα το νερό κατάσβεσης να εξαπλώνει την πυρκαγιά. Ορισμένα έχουν χαμηλό σημείο ανάφλεξης και είναι πολύ πτητικά. Η διαρροή νερού σε αποχετευτικό δίκτυο μπορεί να προκαλέσει κίνδυνο πυρκαγιάς ή έκρηξης. Διαρροή του νερού κατάσβεσης μπορεί να προκαλέσει ρύπανση. Σε ορισμένες περιπτώσεις δοχεία συσκευασίας εκρήγνυνται όταν θερμαίνονται.", "")
	clv2.AddTextItem("ΓΕΝΙΚΕΣ ΟΔΗΓΙΕΣ ΑΝΤΙΜΕΤΩΠΙΣΗΣ ΣΥΜΒΑΝΤΟΣ", "")
	clv2.AddTextItem("• Ενημερώστε το Κέντρο Επιχειρήσεων του Πυροσβεστικού Σώματος.• Διατηρήστε ικανή απόσταση ασφαλείας ανάλογα με το υλικό που εμπλέκεται και την ποσότητα αυτού. Συνδράμετε την ΕΛ.ΑΣ. για τον αποκλεισμό του χώρου ατυχήματος σε όλες τις κατευθύνσεις αρχικά για 50 μέτρα και τουλάχιστον 300 μέτρα σε περίπτωση μεγάλης κηλίδας διαρροής. Εάν εμπλέκονται σε πυρκαγιά δεξαμενές, βαγόνια ή βυτία οχημάτων, συνδράμετε στον αποκλεισμό της περιοχής σε ακτίνα 800 μέτρων σε όλες τις κατευθύνσεις. Εξετάστε την εισήγησή σας στην αρμόδια Αρχή για εκκένωση/οργανωμένη απομάκρυνση των πολιτών.• Επιχειρήστε από την πλευρά που φυσά ο άνεμος (ανάντη, δηλαδή έχοντας τον άνεμο στην πλάτη στραμμένοι προς το περιστατικό).• Φροντίστε για την προσωπική σας ασφάλεια και χρησιμοποιείστε κράνος, αναπνευστική συσκευή θετικής πίεσης, γάντια, επενδύτη πυρκαγιάς, κουκούλα πυρκαγιάς, μπότες, στολή χημικής προστασίας (η οποία μπορεί να παρέχει μικρή ή καθόλου θερμική προστασία) κ.α.ως μέσα ατομικής προστασίας.• Εξαλείψτε τις εστίες ανάφλεξης και πηγές έναυσης. Απομακρύνετε τις άθικτες συσκευασίες από το χώρο της διαρροής/πυρκαγιάς, αν αυτό μπορεί να γίνει με ασφάλεια. Χρησιμοποιήστε εργαλεία που δεν δημιουργούν σπινθήρα.• Αερίστε τους κλειστούς χώρους. Αποφύγετε τους χώρους που βρίσκονται χαμηλά. Αρκετοί ατμοί είναι βαρύτεροι του αέρα, εξαπλώνονται σε όλη την έκταση του εδάφους και συγκεντρώνονται σε χώρους που βρίσκονται χαμηλά (υπόγεια, δεξαμενές, αποχετευτικό δίκτυο).• Χρησιμοποιήστε αφρό για να μειώσετε την παραγωγή ατμών. Πολλά εύφλεκτα υγρά είναι μη αναμίξιμα και ελαφρύτερα του νερού και δεν χρησιμοποιούμε νερό για κατάσβεση. Σε περίπτωση μικρών πυρκαγιών χρησιμοποιήστε ξηρά σκόνη ή CO2 ή αφρό ανθεκτικό στις αλκοόλες ή διασκορπισμένη βολή.• Σε περίπτωση μεγάλων πυρκαγιών χρησιμοποιήστε αφρό, διασκορπισμένη βολή ή βολή ομίχλης. Μη χρησιμοποιείτε συμπαγή βολή για κατάσβεση εύφλεκτων υγρών. Σε ορισμένες περιπτώσεις απαιτείται αφρός ανθεκτικός στις αλκοόλες.• Αντιμετωπίστε την πυρκαγιά από τη μεγαλύτερη δυνατή απόσταση σε περίπτωση που εμπλέκονται δεξαμενές ή φορτία οχημάτων/ρυμουλκούμενων. Ψύξτε τα δοχεία συσκευασίας με μεγάλες ποσότητες νερού για αρκετή ώρα και μετά την κατάσβεση της πυρκαγιάς.• Σε μεγάλες πυρκαγιές χρησιμοποιήστε μη επανδρωμένους ή τηλεκατευθυνόμενους αυλούς κ.α. Αν αυτό είναι αδύνατο αφήστε την πυρκαγιά να εξελιχθεί. ΠΑΝΤΑ μείνετε μακριά από δεξαμενές που τυλίγονται στις φλόγες. Κίνδυνος εμφάνισης φαινομένου BLEVE, κεφ. 15.• Εάν έχουν χυθεί στην άσφαλτο υγρά καύσιμα, ορυκτέλαια κ.α. ενημερώστε τον αρμόδιο φορέα ή την εταιρεία λειτουργίας του αυτοκινητόδρομου για τον καθαρισμό του οδοστρώματος με απορροφητικά ή αδρανή υλικά (πριονίδι, άμμος, χώμα κ.α.) και την περισυλλογή τους.• Αποφύγετε να χυθούν τα υγρά πυρόσβεσης σε δίκτυα αποχέτευσης και υδάτινους πόρους. Αν χρειαστεί δημιουργήστε ανάχωμα για να συγκεντρώσετε τα παραπάνω υγρά ώστε να διατεθούν κατάλληλα. Μη διασκορπίζετε το «χυμένο» υλικό με συμπαγή βολή νερού κ.α.", "")
	clv2.AddTextItem("ΕΝΔΕΙΚΤΙΚΟΣ ΚΑΤΑΛΟΓΟΣ ΕΙΔΩΝ ΚΑΙ ΟΥΣΙΩΝ", "")
clv2.AddTextItem("Υγρά καύσιμα (αργό πετρέλαιο, βενζίνη, πετρέλαιο ντήζελ, κηροζίνη, οινόπνευμα κινητήρων)", "")


 
clv2.AddTextItem("ΠΥΡΟΣΒΕΣΤΙΚΗ ΥΠΗΡΕΣΙΑ ΚΟΜΟΤΗΝΗΣ Μπακάλμπαση 4 ΚΟΜΟΤΗΝΗ Τηλ: 25310-22199", "")
 
	 
	 
clv2.AddTextItem("ΠΥΡΟΣΒΕΣΤΙΚΟ ΚΛΙΜΑΚΙΟ ΣΑΠΠΩΝ", "")
 
clv2.AddTextItem("Δημητρίου Σαγίρη 4 ", "")
clv2.AddTextItem("ΣΑΠΠΕΣ ", "")
clv2.AddTextItem("T.K.: 693 00 ", "")
clv2.AddTextItem("Τηλ: 25320-22304", "")
 
	 
	   
 

 
	 
	 	 

End Sub

Sub clv1_ItemClick (Index As Int, Value As Object)
	Activity.Title = Value
End Sub

Sub CreateListItem(Text As String, Width As Int, Height As Int) As Panel
	Dim p As Panel
	p.Initialize("")
	p.Color = Colors.Black
	Dim b As Button
	b.Initialize("button") 'all buttons click events will be handled with Sub Button_Click
	Dim chk As CheckBox
	chk.Initialize("")
	Dim lbl As Label
	lbl.Initialize("")
	lbl.Gravity = Bit.OR(Gravity.CENTER_VERTICAL, Gravity.LEFT)
	lbl.Text = Text
	lbl.TextSize = 16
	lbl.TextColor = Colors.White
	b.Text = "Click"
	p.AddView(lbl, 5dip, 2dip, 150dip, Height - 4dip) 'view #0
	p.AddView(b, 155dip, 2dip, 110dip, Height - 4dip) 'view #1
	p.AddView(chk, 280dip, 2dip, 50dip, Height - 4dip) 'view #2
	Return p
End Sub



Sub Activity_Resume

End Sub

Sub Activity_Pause (UserClosed As Boolean)

End Sub


